# Types of Data, One Hot encoding, Feature Selection

This notebook will cover:

* Removing and imputing missing values from the dataset
* Getting categorical data into shape for machine learning algorithms
* Selecting relevant features for the model construction

In [112]:
# Libraries

import numpy as np
import pandas as pd
from sklearn.datasets import load_wine
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split

***

# Dealing with missing data

In [2]:
ind = pd.read_csv('indicators_by_company.csv')

In [3]:
# prints the first 5 rows
ind.head()

,company_id,indicator_id,2010,2011,2012,2013,2014,2015,2016
0,1000045,AccountsPayableAndAccruedLiabilitiesCurrentAnd...,NaN,6612429.0,7405579.0,8924919.0,7841070.0,5839000.0,NaN
1,1000045,AccumulatedDepreciationDepletionAndAmortizatio...,NaN,NaN,2111343.0,2242703.0,2236449.0,2462000.0,NaN
2,1000045,AdjustmentForAmortization,NaN,NaN,-11482251.0,-13490892.0,-13852305.0,-13811000.0,NaN
3,1000045,Assets,NaN,257236034.0,263835468.0,283429579.0,302528591.0,325309000.0,NaN
4,1000045,AssetsHeldForSaleAtCarryingValue,NaN,1373001.0,1203664.0,1696330.0,NaN,NaN,NaN

In [4]:
ind.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1907883 entries, 0 to 1907882
Data columns (total 9 columns):
company_id      int64
indicator_id    object
2010            float64
2011            float64
2012            float64
2013            float64
2014            float64
2015            float64
2016            float64
dtypes: float64(7), int64(1), object(1)
memory usage: 131.0+ MB

In [5]:
# basic stats by features
ind.describe()

,company_id,2010,2011,2012,2013,2014,2015,2016
count,1.907883e+06,3.332300e+04,7.944990e+05,1.131808e+06,1.131097e+06,1.139671e+06,1.049133e+06,1.587000e+03
mean,1.017258e+06,1.139017e+09,2.321824e+09,4.349650e+09,1.994103e+09,1.053537e+09,7.616745e+08,2.773091e+08
std,4.634688e+05,6.525528e+10,4.493241e+11,1.750445e+12,6.458664e+11,2.284108e+11,2.946521e+10,1.303021e+09
min,1.750000e+03,-1.461600e+10,-4.489080e+11,-5.611160e+11,-3.761210e+12,-1.470798e+12,-2.490000e+11,-4.311000e+09
25%,8.226620e+05,2.769890e+05,1.108350e+04,1.239800e+04,1.000000e+04,1.056700e+04,1.000000e+04,2.350000e+04
50%,1.083743e+06,2.100000e+07,3.769000e+06,2.281000e+06,2.359000e+06,2.576993e+06,3.000000e+06,1.021700e+07
75%,1.395317e+06,1.942030e+08,5.590000e+07,3.612800e+07,3.800000e+07,4.136600e+07,4.815900e+07,1.057585e+08
max,1.666114e+06,1.183862e+13,2.179510e+14,1.400000e+15,5.000000e+14,2.354225e+14,1.474921e+13,2.621928e+10

In [6]:
ind.isnull().sum()

company_id            0
indicator_id          0
2010            1874560
2011            1113384
2012             776075
2013             776786
2014             768212
2015             858750
2016            1906296
dtype: int64

In [7]:
# drops rows that contains a single Null
ind.dropna(axis=0)

Empty DataFrame
Columns: [company_id, indicator_id, 2010, 2011, 2012, 2013, 2014, 2015, 2016]
Index: []

In [8]:
# drops columns that contains a sigle Null
ind.dropna(axis=1).head()

   company_id                                       indicator_id
0     1000045  AccountsPayableAndAccruedLiabilitiesCurrentAnd...
1     1000045  AccumulatedDepreciationDepletionAndAmortizatio...
2     1000045                          AdjustmentForAmortization
3     1000045                                             Assets
4     1000045                   AssetsHeldForSaleAtCarryingValue

In [9]:
# drops columns that all values are Null
ind.dropna(how='all').head()

,company_id,indicator_id,2010,2011,2012,2013,2014,2015,2016
0,1000045,AccountsPayableAndAccruedLiabilitiesCurrentAnd...,NaN,6612429.0,7405579.0,8924919.0,7841070.0,5839000.0,NaN
1,1000045,AccumulatedDepreciationDepletionAndAmortizatio...,NaN,NaN,2111343.0,2242703.0,2236449.0,2462000.0,NaN
2,1000045,AdjustmentForAmortization,NaN,NaN,-11482251.0,-13490892.0,-13852305.0,-13811000.0,NaN
3,1000045,Assets,NaN,257236034.0,263835468.0,283429579.0,302528591.0,325309000.0,NaN
4,1000045,AssetsHeldForSaleAtCarryingValue,NaN,1373001.0,1203664.0,1696330.0,NaN,NaN,NaN

In [10]:
# drops all rows whose contain less than 6 non Null
ind.dropna(thresh=6).head()

,company_id,indicator_id,2010,2011,2012,2013,2014,2015,2016
0,1000045,AccountsPayableAndAccruedLiabilitiesCurrentAnd...,NaN,6612429.0,7405579.0,8924919.0,7841070.0,5839000.0,NaN
1,1000045,AccumulatedDepreciationDepletionAndAmortizatio...,NaN,NaN,2111343.0,2242703.0,2236449.0,2462000.0,NaN
2,1000045,AdjustmentForAmortization,NaN,NaN,-11482251.0,-13490892.0,-13852305.0,-13811000.0,NaN
3,1000045,Assets,NaN,257236034.0,263835468.0,283429579.0,302528591.0,325309000.0,NaN
6,1000045,Cash,NaN,2803054.0,2797716.0,2635036.0,3388193.0,1849000.0,NaN

### Imputing the missing values

A common tecnique is to use **Imputer** from scikit-learn library. There three

In [11]:
from sklearn.preprocessing import Imputer

In [13]:
imp = Imputer(missing_values='NaN', strategy='mean', axis=0)

/anaconda3/lib/python3.7/site-packages/sklearn/utils/deprecation.py:58: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [14]:
imp.fit(ind.iloc[:, 2:].values)

Imputer(axis=0, copy=True, missing_values='NaN', strategy='mean', verbose=0)

In [15]:
transformed = imp.transform(ind.iloc[:, 2:].values)
df_transformed = pd.DataFrame(transformed, columns=['2010', '2011', '2012', '2013', '2014', '2015', '2016'])
df_transformed.head()

,2010,2011,2012,2013,2014,2015,2016
0,1.139017e+09,6.612429e+06,7405579.0,8924919.0,7.841070e+06,5.839000e+06,2.773091e+08
1,1.139017e+09,2.321824e+09,2111343.0,2242703.0,2.236449e+06,2.462000e+06,2.773091e+08
2,1.139017e+09,2.321824e+09,-11482251.0,-13490892.0,-1.385230e+07,-1.381100e+07,2.773091e+08
3,1.139017e+09,2.572360e+08,263835468.0,283429579.0,3.025286e+08,3.253090e+08,2.773091e+08
4,1.139017e+09,1.373001e+06,1203664.0,1696330.0,1.053537e+09,7.616745e+08,2.773091e+08

# Handling Categorical Data

## Nominal and Ordinal features

**Ordinal data** follows a numerical order, for example shirt size is an ordinal data.

**Nominal data** does not a follow an order, for example color of shirt. Green is not bigger or smaller then red.

In [33]:
df = pd.DataFrame([['green', 'M', 10.1, 'class1'], ['red', 'L', 13.5, 'class2'], ['blue', 'XL', 15.3, 'class1']])

df.columns = ['color', 'size', 'price', 'classlabel']

df

   color size  price classlabel
0  green    M   10.1     class1
1    red    L   13.5     class2
2   blue   XL   15.3     class1

### Mapping ordinal data

In [96]:
mapping = {'M':1, 'L':2, 'XL':3}

In [97]:
df['size']

0     M
1     L
2    XL
Name: size, dtype: object

In [36]:
df['size'] = df['size'].map(mapping)
df

   color  size  price classlabel
0  green     0   10.1     class1
1    red     1   13.5     class2
2   blue     2   15.3     class1

In [37]:
inverse_map = {v:k for k, v in mapping.items()}
inverse_map

{0: 'M', 1: 'L', 2: 'XL'}

In [38]:
df['size'] = df['size'].map(inverse_map)
df

   color size  price classlabel
0  green    M   10.1     class1
1    red    L   13.5     class2
2   blue   XL   15.3     class1

### Encoding Class Labels

Class labels are nominal, therefore it does not follow an order.

In [40]:
class_map = {label: ind for ind, label in enumerate(np.unique(df['classlabel']))}
class_map

{'class1': 0, 'class2': 1}

In [41]:
df['classlabel'] = df['classlabel'].map(class_map)
df

   color size  price  classlabel
0  green    M   10.1           0
1    red    L   13.5           1
2   blue   XL   15.3           0

In [42]:
inv_class_map = {ind:label for label, ind in class_map.items()}

In [43]:
df['classlabel'] = df['classlabel'].map(inv_class_map)
df

   color size  price classlabel
0  green    M   10.1     class1
1    red    L   13.5     class2
2   blue   XL   15.3     class1

***

Now using LabelEncoder from the scikit-learn library.

In [45]:
from sklearn.preprocessing import LabelEncoder

In [46]:
lbe = LabelEncoder()

In [47]:
y = df['classlabel'].values
y

array(['class1', 'class2', 'class1'], dtype=object)

In [51]:
y = lbe.fit_transform(y)
y

array([0, 1, 0])

In [52]:
lbe.inverse_transform(y)

array(['class1', 'class2', 'class1'], dtype=object)

### One-Hot Enconding on Nominal Features

In [94]:
df

   color size  price classlabel
0  green    M   10.1     class1
1    red    L   13.5     class2
2   blue   XL   15.3     class1

In [95]:
pd.get_dummies(df[['color', 'price']])

   price  color_blue  color_green  color_red
0   10.1           0            1          0
1   13.5           0            0          1
2   15.3           1            0          0

In [93]:
pd.get_dummies(df)

,price,color_blue,color_green,color_red,size_L,size_M,size_XL,classlabel_class1,classlabel_class2
0,10.1,0,1,0,0,1,0,1,0
1,13.5,0,0,1,1,0,0,0,1
2,15.3,1,0,0,0,0,1,1,0

In [98]:
df['size'] = df['size'].map(mapping)
df

   color  size  price classlabel
0  green     1   10.1     class1
1    red     2   13.5     class2
2   blue     3   15.3     class1

In [99]:
pd.get_dummies(df[['color', 'price', 'size']])

   price  size  color_blue  color_green  color_red
0   10.1     1           0            1          0
1   13.5     2           0            0          1
2   15.3     3           1            0          0

# Partitioning a Dataset

In [100]:
wine = load_wine()

In [102]:
wine.keys()

dict_keys(['data', 'target', 'target_names', 'DESCR', 'feature_names'])

In [104]:
df_wine = pd.DataFrame(wine['data'], columns=wine['feature_names'])

In [105]:
df_wine.head()

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
0,14.23,1.71,2.43,15.6,127.0,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065.0
1,13.20,1.78,2.14,11.2,100.0,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050.0
2,13.16,2.36,2.67,18.6,101.0,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185.0
3,14.37,1.95,2.50,16.8,113.0,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480.0
4,13.24,2.59,2.87,21.0,118.0,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735.0

In [107]:
df_wine['target'] = wine['target']

df_wine.head()

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline,target
0,14.23,1.71,2.43,15.6,127.0,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065.0,0
1,13.20,1.78,2.14,11.2,100.0,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050.0,0
2,13.16,2.36,2.67,18.6,101.0,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185.0,0
3,14.37,1.95,2.50,16.8,113.0,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480.0,0
4,13.24,2.59,2.87,21.0,118.0,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735.0,0

In [108]:
df_wine.tail()

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline,target
173,13.71,5.65,2.45,20.5,95.0,1.68,0.61,0.52,1.06,7.7,0.64,1.74,740.0,2
174,13.40,3.91,2.48,23.0,102.0,1.80,0.75,0.43,1.41,7.3,0.70,1.56,750.0,2
175,13.27,4.28,2.26,20.0,120.0,1.59,0.69,0.43,1.35,10.2,0.59,1.56,835.0,2
176,13.17,2.59,2.37,20.0,120.0,1.65,0.68,0.53,1.46,9.3,0.60,1.62,840.0,2
177,14.13,4.10,2.74,24.5,96.0,2.05,0.76,0.56,1.35,9.2,0.61,1.60,560.0,2

In [111]:
x , y = df_wine.iloc[:, :-1].values, df_wine.iloc[:, -1].values

In [113]:
x_train, x_test, y_train, y_test = train_test_split(x, y, stratify=y, random_state=1, test_size=0.3)

## Bringing Features to the same Scale

It is well known that converting the features to an standard scale facilitates the optimization of gradient descend, except for decision tree and random forest.

There two popular ways of reducing the features to the same scale. The first tecnique is called **normalization**, which reduce the features to [0, 1]. 

$$x^{(i)}_{norm} = \frac{x^{(i)} - x_{min}}{x_{max} - x_{min}}$$

The second tecnique is called standardization, which transform the data into a normal distribution.

$$x^{(i)}_{std} = \frac{x^{(i)} - \mu_x}{\sigma_x}$$

### Normalization and Standardization

In [122]:
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import StandardScaler

In [123]:
norm = MinMaxScaler()
std = StandardScaler()

In [134]:
num = np.arange(0, 11).reshape(11, 1)

In [135]:
num_norm = norm.fit_transform(num)
num_std = std.fit_transform(num)

/anaconda3/lib/python3.7/site-packages/sklearn/utils/validation.py:595: DataConversionWarning: Data with input dtype int64 was converted to float64 by MinMaxScaler.
  warnings.warn(msg, DataConversionWarning)
/anaconda3/lib/python3.7/site-packages/sklearn/utils/validation.py:595: DataConversionWarning: Data with input dtype int64 was converted to float64 by StandardScaler.
  warnings.warn(msg, DataConversionWarning)
/anaconda3/lib/python3.7/site-packages/sklearn/utils/validation.py:595: DataConversionWarning: Data with input dtype int64 was converted to float64 by StandardScaler.
  warnings.warn(msg, DataConversionWarning)

In [136]:
num_scale = pd.DataFrame(num, columns=['x'])

In [138]:
num_scale['Normalized'] = num_norm
num_scale['Standardized'] = num_std
num_scale

     x  Normalized  Standardized
0    0         0.0     -1.581139
1    1         0.1     -1.264911
2    2         0.2     -0.948683
3    3         0.3     -0.632456
4    4         0.4     -0.316228
5    5         0.5      0.000000
6    6         0.6      0.316228
7    7         0.7      0.632456
8    8         0.8      0.948683
9    9         0.9      1.264911
10  10         1.0      1.581139

In [139]:
stdr = StandardScaler()

In [143]:
x_train_std, x_test_std = stdr.fit_transform(x_train), stdr.transform(x_test)

# Selecting Meaningful Features

To avoid overfitting:

* Collect more training data
* Introduce a penalty for complexity via regularization
* Choose a simpler model with fewer parameters
* Reduce the dimensionality of the data

### Regularization

$$L2 = \sum\limits_{i=1}^{m}\theta_{i}^{2}$$

$$L1 = \sum\limits_{i=1}^{m}\mid\theta_i\mid$$

In [144]:
from sklearn.linear_model import LogisticRegression

In [145]:
lrg = LogisticRegression(penalty='l1')

In [146]:
lrg.fit(x_train_std, y_train)

/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/logistic.py:433: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)
/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/logistic.py:460: FutureWarning: Default multi_class will be changed to 'auto' in 0.22. Specify the multi_class option to silence this warning.
  "this warning.", FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='warn',
          n_jobs=None, penalty='l1', random_state=None, solver='warn',
          tol=0.0001, verbose=0, warm_start=False)

In [149]:
print("Training score: ", str(lrg.score(x_train_std, y_train)))
print("Training score: ", str(lrg.score(x_test_std, y_test)))

Training score:  1.0
Training score:  0.9814814814814815

In [150]:
lrg.intercept_

array([-1.11994168, -1.1351333 , -2.22645254])

In [151]:
lrg.coef_

array([[ 1.41277786,  0.        ,  0.27985968, -1.36317542,  0.        ,
         0.        ,  1.26933839,  0.        ,  0.        ,  0.        ,
         0.        ,  0.71308818,  2.22018433],
       [-1.68965628, -0.37321671, -0.8242191 ,  0.68008321, -0.12019199,
         0.        ,  0.39207709,  0.0100377 ,  0.25231312, -1.42496139,
         1.06237472,  0.        , -2.23319781],
       [ 0.        ,  0.2330119 ,  0.50639243,  0.        ,  0.16162271,
         0.        , -2.4850947 , -0.11846139,  0.        ,  1.64952261,
        -0.88856267, -0.37839126,  0.        ]])

In [152]:
print(np.array(wine['feature_names'])[lrg.coef_[0]==0])
print(np.array(wine['feature_names'])[lrg.coef_[1]==0])
print(np.array(wine['feature_names'])[lrg.coef_[2]==0])

['malic_acid' 'magnesium' 'total_phenols' 'nonflavanoid_phenols'
 'proanthocyanins' 'color_intensity' 'hue']
['total_phenols' 'od280/od315_of_diluted_wines']
['alcohol' 'alcalinity_of_ash' 'total_phenols' 'proanthocyanins' 'proline']